# ####################################################################

#  Created by Genus(TM) Synthesis Solution 21.10-p002_1 on Tue Mar 18 15:19:55 -03 2025

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000fF
set_units -time 1000ps

# Set the current design
current_design sequential

create_clock -name "clk" -period 100.0 -waveform {0.0 50.0} [get_ports clk]
set_load -pin_load 0.045 [get_ports {Q[1]}]
set_load -pin_load 0.045 [get_ports {Q[0]}]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports A]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports B]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports C]
set_input_delay -clock [get_clocks clk] -add_delay 1.0 [get_ports rst]
set_output_delay -clock [get_clocks clk] -add_delay 2.958 [get_ports {Q[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.958 [get_ports {Q[0]}]
set_input_transition -rise -min 0.146 [get_ports A]
set_input_transition -rise -max 0.264 [get_ports A]
set_input_transition -fall -min 0.164 [get_ports A]
set_input_transition -fall -max 0.252 [get_ports A]
set_input_transition -rise -min 0.146 [get_ports B]
set_input_transition -rise -max 0.264 [get_ports B]
set_input_transition -fall -min 0.164 [get_ports B]
set_input_transition -fall -max 0.252 [get_ports B]
set_input_transition -rise -min 0.146 [get_ports C]
set_input_transition -rise -max 0.264 [get_ports C]
set_input_transition -fall -min 0.164 [get_ports C]
set_input_transition -fall -max 0.252 [get_ports C]
set_input_transition -rise -min 0.146 [get_ports rst]
set_input_transition -rise -max 0.264 [get_ports rst]
set_input_transition -fall -min 0.164 [get_ports rst]
set_input_transition -fall -max 0.252 [get_ports rst]
set_ideal_net [get_nets rst]
set_ideal_net [get_nets clk]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFHQX1]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFHQX2]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFHQX4]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFHQX8]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFNSRX1]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFNSRX2]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFNSRX4]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFNSRXL]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFQX1]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFQX2]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFQX4]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFQXL]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFRHQX1]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFRHQX2]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFRHQX4]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFRHQX8]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFRX1]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFRX2]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFRX4]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFRXL]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFSHQX1]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFSHQX2]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFSHQX4]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFSHQX8]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFSRHQX1]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFSRHQX2]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFSRHQX4]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFSRHQX8]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFSRX1]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFSRX2]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFSRX4]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFSRXL]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFSX1]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFSX2]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFSX4]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFSXL]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFTRX1]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFTRX2]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFTRX4]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFTRXL]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFX1]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFX2]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFX4]
set_dont_use true [get_lib_cells slow_vdd1v0/SDFFXL]
set_dont_use true [get_lib_cells slow_vdd1v0/TLATSRX1]
set_dont_use true [get_lib_cells slow_vdd1v0/TLATSRX2]
set_dont_use true [get_lib_cells slow_vdd1v0/TLATSRX4]
set_dont_use true [get_lib_cells slow_vdd1v0/TLATSRXL]
set_dont_use true [get_lib_cells fast_vdd1v2/SDFFHQX1]
set_dont_use true [get_lib_cells fast_vdd1v2/SDFFHQX2]
set_dont_use true [get_lib_cells fast_vdd1v2/SDFFHQX4]
set_dont_use true [get_lib_cells fast_vdd1v2/SDFFHQX8]
set_dont_use true [get_lib_cells fast_vdd1v2/SDFFNSRX1]
set_dont_use true [get_lib_cells fast_vdd1v2/SDFFNSRX2]
set_dont_use true [get_lib_cells fast_vdd1v2/SDFFNSRX4]
set_dont_use true [get_lib_cells fast_vdd1v2/SDFFNSRXL]
set_dont_use true [get_lib_cells fast_vdd1v2/SDFFQX1]
set_dont_use true [get_lib_cells fast_vdd1v2/SDFFQX2]
set_dont_use true [get_lib_cells fast_vdd1v2/SDFFQX4]
set_dont_use true [get_lib_cells fast_vdd1v2/SDFFQXL]
set_dont_use true [get_lib_cells fast_vdd1v2/SDFFRHQX1]
set_dont_use true [get_lib_cells fast_vdd1v2/SDFFRHQX2]
set_dont_use true [get_lib_cells fast_vdd1v2/SDFFRHQX4]
set_dont_use true [get_lib_cells fast_vdd1v2/SDFFRHQX8]
set_dont_use true [get_lib_cells fast_vdd1v2/SDFFRX1]
set_dont_use true [get_lib_cells fast_vdd1v2/SDFFRX2]
set_dont_use true [get_lib_cells fast_vdd1v2/SDFFRX4]
set_dont_use true [get_lib_cells fast_vdd1v2/SDFFRXL]
set_dont_use true [get_lib_cells fast_vdd1v2/SDFFSHQX1]
set_dont_use true [get_lib_cells fast_vdd1v2/SDFFSHQX2]
set_dont_use true [get_lib_cells fast_vdd1v2/SDFFSHQX4]
set_dont_use true [get_lib_cells fast_vdd1v2/SDFFSHQX8]
set_dont_use true [get_lib_cells fast_vdd1v2/SDFFSRHQX1]
set_dont_use true [get_lib_cells fast_vdd1v2/SDFFSRHQX2]
set_dont_use true [get_lib_cells fast_vdd1v2/SDFFSRHQX4]
set_dont_use true [get_lib_cells fast_vdd1v2/SDFFSRHQX8]
set_dont_use true [get_lib_cells fast_vdd1v2/SDFFSRX1]
set_dont_use true [get_lib_cells fast_vdd1v2/SDFFSRX2]
set_dont_use true [get_lib_cells fast_vdd1v2/SDFFSRX4]
set_dont_use true [get_lib_cells fast_vdd1v2/SDFFSRXL]
set_dont_use true [get_lib_cells fast_vdd1v2/SDFFSX1]
set_dont_use true [get_lib_cells fast_vdd1v2/SDFFSX2]
set_dont_use true [get_lib_cells fast_vdd1v2/SDFFSX4]
set_dont_use true [get_lib_cells fast_vdd1v2/SDFFSXL]
set_dont_use true [get_lib_cells fast_vdd1v2/SDFFTRX1]
set_dont_use true [get_lib_cells fast_vdd1v2/SDFFTRX2]
set_dont_use true [get_lib_cells fast_vdd1v2/SDFFTRX4]
set_dont_use true [get_lib_cells fast_vdd1v2/SDFFTRXL]
set_dont_use true [get_lib_cells fast_vdd1v2/SDFFX1]
set_dont_use true [get_lib_cells fast_vdd1v2/SDFFX2]
set_dont_use true [get_lib_cells fast_vdd1v2/SDFFX4]
set_dont_use true [get_lib_cells fast_vdd1v2/SDFFXL]
set_dont_use true [get_lib_cells fast_vdd1v2/TLATSRX1]
set_dont_use true [get_lib_cells fast_vdd1v2/TLATSRX2]
set_dont_use true [get_lib_cells fast_vdd1v2/TLATSRX4]
set_dont_use true [get_lib_cells fast_vdd1v2/TLATSRXL]
set_clock_latency  0.35 [get_clocks clk]
set_clock_uncertainty -setup 0.25 [get_clocks clk]
set_clock_uncertainty -hold 0.25 [get_clocks clk]
